app/views/rooms/_review.html.erb

SELECT AVG("reviews"."points") AS avg_id FROM "reviews" WHERE "reviews"."room_id" = 3
---

		<% (room.review_points.max - room.stars).times do %>