app/controllers/rooms_controller.rb

  def index
    @search_query = params[:q]

    rooms = Room.search(@search_query).page(params[:page]).per(PER_PAGE)
---
SELECT "rooms".* FROM "rooms" WHERE (location LIKE '%#{query}%' OR title LIKE '%#{query}%' OR description LIKE '%#{query}%') ORDER BY created_at DESC
SELECT COUNT(*) FROM "rooms"

  def show
    room_model = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @room = current_user.rooms.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @room = current_user.rooms.build(params[:room])
    if @room.save
---
INSERT INTO "rooms" ("created_at", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 29 Nov 2012 17:05:56 UTC +00:00], ["description", "teste"], ["location", "teste"], ["title", "teste"], ["updated_at", Thu, 29 Nov 2012 17:05:56 UTC +00:00]]

  def update
    @room = current_user.rooms.find(params[:id])

    if @room.update_attributes(params[:room])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "rooms" SET "description" = 'testelallaaeuahiuehauiheuhauiehiuaheuihauiheahueihaheiuahuieha', "updated_at" = '2012-12-06 19:47:50.524308' WHERE "rooms"."id" = 2

  def destroy
    @room = current_user.rooms.find(params[:id])
    @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]