app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("bio", "confirmation_token", "confirmed_at", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "password_digest" = '$2a$10$qzzJ4tE4ZWYmrcn0CU6TDe/HdhyU9OZyUObSq.Rs6mKGOSVkCD.Ua', "updated_at" = '2012-12-06 16:14:24.618147' WHERE "users"."id" = 3