app/controllers/rooms/reviews_controller.rb

	def create
		review = room.reviews.find_or_initialize_by_user_id(current_user.id)

		review.update_attributes!(params[:review])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."room_id" = 3 AND "reviews"."user_id" = 7 LIMIT 1
UPDATE "rooms" SET "reviews_count" = COALESCE("reviews_count", 0) + 1 WHERE "rooms"."id" = 3